#language:ru

Функционал: Домашнее задание

  Структура сценария: №1 Открытие курса по имени и проверка открытой страницы
    Когда откроем браузер
    И откроем страницу курсов
    И откроем курс <course>
    И проверим на открывшейся странице заголовок <course>
    Примеры:
      | course                     |
      | SRE практики и инструменты |

  Сценарий: №3 Открытие и проверка случайного курса
    Когда откроем браузер
    И откроем главную страницу
    Тогда откроем случайное направление и проверим наименование

